[
  {
    "title": "B.30 Bowling for Scruples 7: Sorry for Scruplin'",
    "description": "The Barone Boys go head-to-head-to-head in another round of the moral quandary-centric and poorly copyedited game of Scruples.",
    "pubDate": "Fri, 31 Jan 2025 17:00:00 +0000"
  },
  {
    "title": "B.29 FRANgandhRAYous Bazingsterds: The Nanny 5.18 The Reunion Show",
    "description": "Mike and Adam unpack the epic crossover event that is Ray Barone’s appearance in Season 5, Episode 18 of The Nanny, “The Reunion Show”.\nPlease go show some love to Diego Brancaccio’s piano cover of The Nanny theme song.",
    "pubDate": "Tue, 31 Dec 2024 17:00:00 +0000"
  },
  {
    "title": "B.28 BarONUS pre-shOwNUS, Vol. 3",
    "description": "Another compilation of pre-show chats from 4.10, 4.17, B.24, and B.27, plus two deleted scenes from 4.12.",
    "pubDate": "Sat, 30 Nov 2024 17:00:00 +0000"
  },
  {
    "title": "B.27 The HefferMen: KoQ 1.9 Road Rayge",
    "description": "Adam and Mike break down the epic crossover event that is Season 1 Episode 9 of the King of Queens, “Road Rayge.”\nSome notes:\nJacob Neufeld’s beautiful rendition of the King of Queens theme song\n\n\nEven More Shameless Crossover Monday\n\nThe International Prototype of the Kilogram",
    "pubDate": "Thu, 31 Oct 2024 16:00:00 +0000"
  },
  {
    "title": "B.26 The gRAYt’Til Deadth: 1.16 The Italian Affair",
    "description": "Adam and Mike break down Ray Romano’s cameo in Season 1, Episode 16 of the Brad Garrett sitcom ’Til Death, “The Italian Affair.”",
    "pubDate": "Mon, 30 Sep 2024 05:01:00 +0000"
  },
  {
    "title": "B.25 Bowling for Scruples 6: The Great Scruples ELECTION Case (or, Scru Plethedrals)",
    "description": "The Barone Boys play another round of America’s favorite moral quandary-centric card game, and also react to the 2024 election’s big October surprise: Kamala Harris talking about Scruples.",
    "pubDate": "Sat, 31 Aug 2024 16:00:00 +0000"
  },
  {
    "title": "B.24 Who Wants to Be a M(ar)i(e)llionaire?",
    "description": "Adam and Mike discuss Ray Romano and Brad Garrett’s joint appearance on Who Wants to Be a Millionaire? before Mike attempts to answer the same questions.",
    "pubDate": "Wed, 31 Jul 2024 16:00:00 +0000"
  },
  {
    "title": "B.23 BarONUS pre-shOwNUS, Vol. 2",
    "description": "A new compilation of pre-show chats from the second half of season 3 and the start of season 4.",
    "pubDate": "Sun, 30 Jun 2024 05:01:00 +0000"
  },
  {
    "title": "B.22 Bowling for Scruples 5: A Hangover You Don't D'Scruple",
    "description": "The Barone Boys administer sound spankings in another round of Scruples.",
    "pubDate": "Fri, 31 May 2024 05:01:00 +0000"
  },
  {
    "title": "B.21 RAYnking Season 2",
    "description": "The Barone Boys raynk all of the Season 2 episodes in a classic tier list format. See our Season 1 and 2 tier lists here!",
    "pubDate": "Tue, 30 Apr 2024 05:01:00 +0000"
  },
  {
    "title": "B.20 Fanfiction Theatre: Everybody Loves Robert",
    "description": "Nearly 2 years after reading the first chapter of A Grayer Shade of Gray’s Everybody Loves Robert on our episode 1.12, the Barone Boys bring the saga to a close…for now.",
    "pubDate": "Sun, 31 Mar 2024 05:01:00 +0000"
  },
  {
    "title": "B.19 RAYnking Season 1",
    "description": "The Barone Boys raynk all of the Season 1 episodes in a classic tier list format.",
    "pubDate": "Thu, 29 Feb 2024 06:01:00 +0000"
  },
  {
    "title": "B.18 BILLY IS BACK",
    "description": "Billy Joel is back with his first new single in 17 years! After discussing their anticipation before recording 3.19, Mike and Adam decided to get together as soon as it was released to record an emergency BarONUS review of “Turn the Lights Back On.”",
    "pubDate": "Thu, 01 Feb 2024 06:01:00 +0000"
  },
  {
    "title": "B.17 The Middle Men: Luhrmann & Thurman (2.1, 2.17, & 2.24)",
    "description": "The Middle Men unpack a couple of very special episodes of The Middle: Season 2, Episodes 1, 17, and 24, featuring Doris Roberts as Ms. Rinsky, Brick’s teacher.",
    "pubDate": "Sun, 31 Dec 2023 06:01:00 +0000"
  },
  {
    "title": "B.16 The Middle Men: Wet, White Bread (3.1 & 3.2)",
    "description": "The Middle Men tackle Ray Romano’s appearance as Nicky Kohlbrenner in the two-part Season 3 premiere of The Middle.",
    "pubDate": "Thu, 30 Nov 2023 06:01:00 +0000"
  },
  {
    "title": "B.15 Banana for Scale / 3.7 Take 1",
    "description": "Our first attempt at 3.7 didn’t really have the Barone Boys magic, so we decided to shelve this one - until now! Thanks, editing!",
    "pubDate": "Tue, 31 Oct 2023 05:00:00 +0000"
  },
  {
    "title": "B.14 BarONUS pre-shOwNUS, Vol. 1 (3.8, 3.10, & 3.12)",
    "description": "A compilation of our pre-show chats. This edition:\nFinding Erdos (3.8): Adam and Mike do some research on Todd Erdos.\nThe NFL Challenge (3.10): Mike asks Adam to name three active quarterbacks.\nSchneider’s Tech Trouble (3.12): The Barone Boys stall as guest Joseph Schneider searches for his headphones.",
    "pubDate": "Sat, 30 Sep 2023 05:01:00 +0000"
  },
  {
    "title": "B.13 Somewhere in Mooseport",
    "description": "The Barone Boys study Ray’s star turn in “Welcome to Mooseport” (2004).",
    "pubDate": "Thu, 31 Aug 2023 05:00:00 +0000"
  },
  {
    "title": "B.12 Ray Ray...Don't Tell Me!",
    "description": "Mike G hosts a game inspired by Ray Romano’s May 6, 2023 appearance on NPR’s seminal panel show, Wait Wait…Don’t Tell Me!",
    "pubDate": "Fri, 28 Jul 2023 05:01:00 +0000"
  },
  {
    "title": "B.11 Bowling for Scruples 4: Scrupulous Enough to Dance",
    "description": "The Barone Boys play their fourth ever round of Scruples.",
    "pubDate": "Fri, 30 Jun 2023 05:01:00 +0000"
  },
  {
    "title": "B.10 Bowling for Scruples 3: Let's Do it for Scruples!",
    "description": "Still in Jamaica, the Barone Boys careen through another round of Scruples.",
    "pubDate": "Thu, 01 Jun 2023 03:59:00 +0000"
  },
  {
    "title": "B.9 Somewhere in Queens",
    "description": "From Jamaica (and not the one in Queens), the Barone Boys wax poetic about Ray Romano’s new film Somewhere in Queens.",
    "pubDate": "Mon, 01 May 2023 03:58:00 +0000"
  },
  {
    "title": "B.8 Bowling for Scruples 2: Rock on Scrupulous Ones!!",
    "description": "The Barone Boys play a second rousing round of Scruples.",
    "pubDate": "Fri, 31 Mar 2023 05:01:00 +0000"
  },
  {
    "title": "B.7 Love Raymond or List Raymond",
    "description": "Two young professionals look for a house that is walking distance to the beach, close to the city center, and is (or was formerly) owned by Ray Romano. Here’s Ray’s Venice farmhouse, his Toluca Lake fixer-upper, and the article about his Malibu beach house!",
    "pubDate": "Tue, 28 Feb 2023 06:01:00 +0000"
  },
  {
    "title": "B.6 CelebRAYty JeopRAYdy!",
    "description": "The Barone Boys break down Ray Romano’s appearance on Celebrity Jeopardy! and play CelebRAYty JeopRAYdy!",
    "pubDate": "Wed, 01 Feb 2023 04:59:00 +0000"
  },
  {
    "title": "B.5 Bowling for Scruples",
    "description": "The Barone Boys fill some time with a rousing game of Scruples! Play at home!",
    "pubDate": "Wed, 07 Dec 2022 06:01:00 +0000"
  },
  {
    "title": "B.4 Good Morning, Basketball Court: A Judge Debra Story (w/ Khalonji Bulluck)",
    "description": "Judge Debra’s back, baby! Adam, Alex, and most-valuable guest Khalonji Bulluck head down to the Lynbrook Sportsplex to adjudicate another classic case: Who would win in a basketball game between Nemo’s Pizza and the Impractical Jokers?",
    "pubDate": "Wed, 09 Nov 2022 06:01:00 +0000"
  },
  {
    "title": "B.3 Fanfiction Theatre: The Right Kind of Wrong (w/ Alexa Madison & Joseph Schneider)",
    "description": "The Barone Boys and their dear friends present a reading of The Right Kind of Wrong by Patricia Heaton Forever (Debra Barone Barone), published January 21, 2002. This was performed and sound designed exactly as written.",
    "pubDate": "Wed, 12 Oct 2022 05:01:00 +0000"
  },
  {
    "title": "B.2 Brad Garrett in Fresh Prince 5.5",
    "description": "This Raymembrance was too compelling to cover on 1.17, so the Barone Boys adjourn to their screening room to break down Brad Garrett’s appearance in Season 5, Episode 5 of The Fresh Prince of Bel-Air, along with some talk about attending Will’s performance at the Live 8 concert, Adam’s lawsuit against the producers of The Pursuit of Happyness, cathode ray tubes, and Lynbrook’s Little Ireland. All the important questions are answered: Is Bertha cancelled? How did Jazz know what Fingers looked like? And most critically - will we be dropping Raymond for Fresh Prince?",
    "pubDate": "Wed, 21 Sep 2022 05:01:00 +0000"
  },
  {
    "title": "B.1 Good Morning, Night Court: A Judge Debra Story",
    "description": "In a case for the ages, Judge Debra must decide if Robert Barone is a superior lawman to Night Court’s Bull Shannon. With nobody involved having seen Night Court ever or at all, the Barone Boys sequester the jury in the Lynbrook Howard Johnson’s to deliberate.",
    "pubDate": "Thu, 08 Sep 2022 20:18:00 +0000"
  }
]